# Задача №1 Написать программу, которая принимает на вход число N и выдает последовательность из N членов

# N = int(input('Введите число: '))
# result = None

# for i in range(N):
#     result += str((-3) ** i) + ', '
# print (result)

# Задача №2 Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1

# n = int(input('Введите число: '))
# vac = {i : (3 * i + 1) for i in range(1, n + 1)}
# vac.update({n : (3n + 1)})
# print(vac)

# Задача №3 Написать программу в которой пользователь будет задавать две строки, а программа определять - количество вхождений одной строки
# в другой

# str1 = input('Введите 1-ю строку: ')
# str2 = input('Введите строку для проверки вхождений: ')
# print(str2.count(str1))

# for i in range (3):
#     print(str1[i:i + 1:])